IDEA Connection Link
ConnectionSrv.GetWeldUid Method
 Weld id from connection model
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public int GetWeldUid(
	Guid connectionId,
	int tableId
)
Public Function GetWeldUid (
	connectionId As Guid,
	tableId As Integer
) As Integer
public:
int GetWeldUid(
	Guid connectionId,
	int tableId
)
Parameters
connectionId
Type: System.Guid
Connection ID
tableId
Type: System.Int32
Weld result table Id
Return Value
Type: Int32
 Weld id from connection model
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace